W10/D1/goal_app/app/controllers/users_controller.rb

    def show
        @user = User.find_by(id: params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 45], ["LIMIT", 1]]

    def create

        @user = User.new(user_params)

        if @user.save
---
INSERT INTO "users" ("username", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"