W9/D3/ninety_nine_cats/app/controllers/cats_controller.rb

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @cat = Cat.find_by(id: params[:id])

SELECT  "cats".* FROM "cats" WHERE (1) LIMIT $1  [["LIMIT", 1]]
---
    def index
        @cats = Cat.all

INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
        @cat = Cat.new(cat_params)

        if @cat.save

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def edit
        @cat = Cat.find_by(id: params[:id])

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cats" SET "sex" = $1, "color" = $2, "updated_at" = $3 WHERE "cats"."id" = $4  [["sex", "F"], ["color", "grey"], ["updated_at", "2019-03-06 22:34:45.585353"], ["id", 3]]
---
    def update
        @cat = Cat.find_by(id: params[:id])
        if @cat.update_attributes(cat_params)