W9/D1/first_routes/app/controllers/artworks_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
INSERT INTO "artworks" ("title", "image_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Trevor's Masterpiece"], ["image_url", "/images/img8"], ["artist_id", 6], ["created_at", "2019-03-04 23:48:16.229279"], ["updated_at", "2019-03-04 23:48:16.229279"]]
---
    def index
        # /users/:user_id/artworks
        user_id = params[:user_id]
        user = User.find(user_id)
        owned_artwork = user.artworks
        viewed_artwork = user.shared_artworks

        artworks = owned_artwork
        artworks << viewed_artwork