W9/D1/first_routes/app/controllers/artworks_controller.rb

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def show
        render json: Artwork.find(params[:id])

SELECT "artworks".* FROM "artworks" WHERE "artworks"."artist_id" = $1  [["artist_id", 23]]
SELECT "artworks".* FROM "artworks" INNER JOIN "artwork_shares" ON "artworks"."id" = "artwork_shares"."artwork_id" WHERE "artwork_shares"."viewer_id" = $1  [["viewer_id", 6]]
---
    def index
        # /users/:user_id/artworks
        user_id = params[:user_id]

        owned_artwork = Artwork.where(:artist_id => user_id)
        viewed_artwork = ArtworkShare.where(:viewer_id => user_id).first.artwork

INSERT INTO "artworks" ("title", "image_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Trevor's Masterpiece"], ["image_url", "/images/img8"], ["artist_id", 6], ["created_at", "2019-03-04 23:48:16.229279"], ["updated_at", "2019-03-04 23:48:16.229279"]]
---
    def create
        artwork = Artwork.new(artwork_params)
        if artwork.save

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]
---
    def update
        artwork = Artwork.find(params[:id])

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 3]]
---
    def destroy
        artwork = Artwork.find(params[:id])

        render json: artwork.destroy