W9/D1/first_routes/app/controllers/artwork_collections_controller.rb

    def create
        artwork_collection = ArtworkCollection.new(artwork_collection_params)
        if artwork_collection.save
---
INSERT INTO "artwork_collections" ("user_id", "artwork_id", "collection_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 23], ["artwork_id", 19], ["collection_id", 1], ["created_at", "2019-03-05 23:54:29.345754"], ["updated_at", "2019-03-05 23:54:29.345754"]]