W9/D1/first_routes/app/controllers/comments_controller.rb

    def index
        if params.has_key?(:user_id)
            comments = User.find(params[:user_id]).comments
            render json: comments
        elsif params.has_key?(:artwork_id)
            comments = Artwork.find(params[:artwork_id]).comments
---
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 23]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 18]]
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]