W9/D1/first_routes/app/controllers/likes_controller.rb

    def index
        if params.has_key?(:user_id)
            likes = User.find(params[:user_id]).liked_comments
            likes << User.find(params[:user_id]).liked_artworks
            render json: likes
        elsif params.has_key?(:artwork_id)
            likes = Artwork.find(params[:artwork_id]).liking_users
            render json: likes
        elsif params.has_key?(:comment_id)
            likes = Comment.find(params[:comment_id]).liking_users
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]

    def create

        like = Like.new(like_params)
        if like.save
---
INSERT INTO "likes" ("likeable_type", "likeable_id", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["likeable_type", "Comment"], ["likeable_id", 8], ["created_at", "2019-03-05 22:17:16.974709"], ["updated_at", "2019-03-05 22:17:16.974709"], ["user_id", 23]]

    def destroy
        like = Like.find(params[:id])

        render json: like.destroy
---
SELECT  "likes".* FROM "likes" WHERE "likes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 1]]