W9/D1/first_routes/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        render json: User.find(params[:id])

SELECT "users".* FROM "users" WHERE (username=Eyvind Earle)
SELECT "users".* FROM "users"
---
    def index
        if params.has_key?(:query)
            base = params[:query]
            pattern = "%#{base}%"
            users = User.where('username LIKE ?', pattern)
            render json: users
        else
            render json: User.all

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Valery"], ["email", "v@aol.com"], ["created_at", "2019-03-04 21:52:09.178758"], ["updated_at", "2019-03-04 21:52:09.178758"]]
---
    def favorites
        favorites = User.find(params[:id]).favorited_own_artworks
        favorites << User.find(params[:id]).favorited_shared_artworks

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Valery"], ["email", "v@aol.com"], ["created_at", "2019-03-04 21:52:09.178758"], ["updated_at", "2019-03-04 21:52:09.178758"]]
---
    def create
        user = User.new(user_params)
        if user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "Trevor"], ["email", "t@gmail.com"], ["updated_at", "2019-03-04 22:00:22.920332"], ["id", 1]]
---
    def update
        user = User.find(params[:id])
        if user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]
---
    def destroy
        user = User.find(params[:id])

        render json: user.destroy